{"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"50":1,"120":1,"256":1,"2020":1,"2022":1,"2000000":1,"3860000":1,"12000000":1,"24000000":1,"__vocabulary":["version","02","c","tekmonks","reflection","network","product","description","author","dewar","mccambridge","august","04","2022","approved","for","distribution","by","all","the","following","aspects","of","are","proprietary","and","developed","in","house","table","contents","introduction","components","benefits","compared","traditional","vpn","proxy","gateways","smart","firewall","distinction","additional","include","but","may","not","be","limited","to","client","journey","deployment","options","reflector","option","1","installers","2","vm","customers","shared","architecture","summary","setup","using","what","they","have","common","use","cases","case","two","insurance","company","s","three","japanese","companies","working","from","home","financial","regarding","leading","global","e","commerce","other","conclusion","this","report","is","intended","architects","cybersecurity","analysts","partners","wanting","obtain","a","complete","understanding","regardless","question","type","ie","customer","or","technical","it","assumed","that","reader","familiar","with","basic","concepts","has","knowledge","fundamental","protocols","such","as","tcp","ip","which","underpin","modern","internet","data","contained","was","measured","controlled","environment","results","obtained","environments","vary","internal","server","application","device","sealed","inside","corporate","being","reflected","out","mirror","via","component","reflects","required","end","point","serving","users","portal","sometimes","added","based","on","requirements","example","where","log","into","pass","authentication","gaining","access","security","only","allows","specific","authenticated","together","make","up","call","suitable","securing","applications","assets","must","exposed","used","business","utilized","agents","agencies","resellers","etc","examples","mobile","b2b","like","agency","portals","reseller","require","secure","ensuring","traffic","ensures","through","no","can","actually","establish","their","own","connection","original","servers","replacing","current","configuration","itself","contains","privileges","meaning","even","if","breach","occurs","taken","back","established","gateway","takes","place","then","formed","section","segmentation","protection","tools","terms","firewalls","vpns","comparison","will","made","along","showcasing","advantages","provided","unlike","apps","do","companys","reduces","risks","related","personal","exploits","malware","devices","networks","managed","whether","user","trojan","horses","vulnerable","targeted","hackers","remain","safe","there","direct","tunnel","between","deploying","model","similar","opening","ports","any","remote","would","full","blown","audit","hardening","when","considering","includes","dividing","subnetworks","reinforcing","passwords","closing","unnecessary","pertinent","steps","easy","see","preparations","considerable","project","utilizing","means","these","accessible","web","published","requiring","zero","open","changes","fine","grained","role","controls","hr","proxies","everything","available","control","you","also","think","secured","office","building","having","front","door","whole","nothing","stopping","people","walking","please","once","adding","each","floor","floors","representing","individual","system","multi","level","systems","so","though","one","first","entry","cannot","go","doors","multiple","measures","technology","saves","significant","bandwidth","support","much","more","than","laptop","rest","goes","over","regular","furthermore","critical","difference","architectures","summarized","figure","hacker","bypassed","real","mirrors","themselves","gains","strong","layers","we","discuss","ignoring","aspect","shortly","however","important","here","step","somehow","breached","form","including","segregation","desktop","allocated","its","distinct","port","said","closed","subsequently","opened","who","authorization","those","an","engineer","b","authenticates","correctly","engineers","removing","ability","attempt","lateral","movement","blocking","preemptively","bans","attacks","ips","largest","database","db","curated","blacklists","integration","nist","nvd","us","government","national","vulnerability","exploit","anti","spam","virus","app","detection","google","store","dbs","url","script","blocks","prevent","external","hosted","eg","xss","vulnerabilities","preventing","various","injection","query","parameter","parsing","at","layer","7","sql","xml","injections","convert","mfa","compliant","heuristic","rules","outbound","against","leaks","deep","logging","audits","soc","module","logs","admin","comes","process","differ","depending","granular","choices","location","prem","cloud","outside","dmz","installed","scenario","under","assumption","deployed","virtual","machine","hardware","within","clients","choose","method","installer","executable","file","need","run","desktops","wish","connect","securely","below","simple","diagram","6","instance","both","pcs","install","connects","individually","number","accessing","remotely","running","mapped","certain","after","installation","been","successfully","set","formulate","dhcp","some","changing","wireless","ethernet","ensure","stability","thats","restart","service","refreshed","again","most","importantly","previous","connected","originally","remains","same","local","loopback","address","generate","rdp","changed","does","matter","forwarded","during","time","popup","appears","create","account","login","credentials","chooses","creating","phase","given","turn","unique","id","add","currently","existing","instead","successful","maps","machines","created","them","connections","per","approach","deploys","containing","reflectors","perimeter","desired","services","accessed","large","scale","responsible","forwarding","still","computers","above","8","note","windows","covers","variety","nav","legacy","short","anything","send","gained","why","needs","segment","list","provide","addresses","stored","reference","updated","10","setting","follows","receive","files","manually","join","representative","get","walked","3","notify","completed","configurations","installing","ova","hyper","v","dev","computer","appliance","virtualization","vmware","workstation","oracle","virtualbox","package","describe","ovf","descriptor","optional","manifest","mf","certificate","additionally","supports","plug","play","sent","physical","box","already","confirmation","power","plugged","administers","skipping","result","depicted","9","now","differences","discussed","highlighted","stated","earlier","choice","instances","requested","program","instructs","particular","static","supported","clipboard","transfer","restrictions","just","requires","sending","wake","lan","message","assigned","14","disclose","name","due","nda","refer","adoption","year","2020","duration","years","challenge","had","functions","associated","daily","tasks","private","connectivity","communications","were","threats","upon","resources","explicit","custom","solutions","lacking","particularly","as400","solution","terminated","implemented","built","extra","emphasis","block","incoming","makes","completely","while","mirrored","hence","registered","allowed","13","view","15","asking","consent","our","teleworking","increasingly","popular","reasons","work","life","balance","widespread","availability","computing","viable","types","organizations","hit","issue","everyone","facing","globally","covid","19","pandemic","causing","great","individuals","struggling","find","way","allow","reliable","keeping","employees","safety","mind","effectively","efficiently","expressed","throughout","document","course","mentioned","applies","relation","adapting","change","extremely","fast","procedure","limitations","macos","tablet","smartphone","4","cap","amount","different","share","among","products","market","buy","licenses","bulk","license","16","creation","very","nature","cyberattack","immeasurable","benefit","corporation","primary","estimated","information","estimations","known","facts","generic","overview","corporations","calculate","risk","anyone","rough","estimation","before","approached","least","month","impactful","hacking","statistics","average","cost","3860000","usd","excluding","breaches","small","ones","skew","numerical","value","deduced","stages","response","attack","heavy","costs","incurred","pour","processes","investigation","assessment","general","crisis","management","notifying","key","third","parties","stakeholders","emails","letters","notice","engagement","experts","attempting","minimize","loss","activities","side","effect","disruption","down","losing","regain","new","avoiding","reputation","bad","faith","post","spend","fees","legalities","recuperating","losses","patches","training","help","desk","staff","outlook","five","never","subjected","previously","months","prior","contacting","ibm","5","17","adopting","underestimate","2000000","12000000","damages","joining","basis","24000000","seeing","grand","total","120","million","potential","caused","cyberattacks","reduced","implementing","going","fit","every","single","hacked","depends","factors","size","severity","hundreds","millions","dollars","less","lot","spent","decide","hire","pay","legal","lead","dependent","resolution","path","take","brings","nonspecific","amp","cdn","waf","ddos","mitigation","save","money","software","hasily","meet","pci","compliance","fully","isolated","goals","confidential","communication","aes","256","encrypted","military","grade","encryption","gdpr","foreign","country","yet","able","act","improved","performance","50","crucial","serve","volume","perform","faster","speed","delay","overall","improvement","job","18","peace","your","provides","well","stress","increasing","productivity","allocate","funding","goal","streamlined","organizational","reduce","inspire","achieve","remaining","intensely","focused","satisfaction","without","distractions","look","forward","future","let","know","questions","concerns"],"version":1,"02":1,"c":1,"tekmonks":1,"reflection":1,"network":1,"product":1,"description":1,"author":1,"dewar":1,"mccambridge":1,"august":1,"04":1,"approved":1,"for":1,"distribution":1,"by":1,"all":1,"the":1,"following":1,"aspects":1,"of":1,"are":1,"proprietary":1,"and":1,"developed":1,"in":1,"house":1,"table":1,"contents":1,"introduction":1,"components":1,"benefits":1,"compared":1,"traditional":1,"vpn":1,"proxy":1,"gateways":1,"smart":1,"firewall":1,"distinction":1,"additional":1,"include":1,"but":1,"may":1,"not":1,"be":1,"limited":1,"to":1,"client":1,"journey":1,"deployment":1,"options":1,"reflector":1,"option":1,"installers":1,"vm":1,"customers":1,"shared":1,"architecture":1,"summary":1,"setup":1,"using":1,"what":1,"they":1,"have":1,"common":1,"use":1,"cases":1,"case":1,"two":1,"insurance":1,"company":1,"s":1,"three":1,"japanese":1,"companies":1,"working":1,"from":1,"home":1,"financial":1,"regarding":1,"leading":1,"global":1,"e":1,"commerce":1,"other":1,"conclusion":1,"this":1,"report":1,"is":1,"intended":1,"architects":1,"cybersecurity":1,"analysts":1,"partners":1,"wanting":1,"obtain":1,"a":1,"complete":1,"understanding":1,"regardless":1,"question":1,"type":1,"ie":1,"customer":1,"or":1,"technical":1,"it":1,"assumed":1,"that":1,"reader":1,"familiar":1,"with":1,"basic":1,"concepts":1,"has":1,"knowledge":1,"fundamental":1,"protocols":1,"such":1,"as":1,"tcp":1,"ip":1,"which":1,"underpin":1,"modern":1,"internet":1,"data":1,"contained":1,"was":1,"measured":1,"controlled":1,"environment":1,"results":1,"obtained":1,"environments":1,"vary":1,"internal":1,"server":1,"application":1,"device":1,"sealed":1,"inside":1,"corporate":1,"being":1,"reflected":1,"out":1,"mirror":1,"via":1,"component":1,"reflects":1,"required":1,"end":1,"point":1,"serving":1,"users":1,"portal":1,"sometimes":1,"added":1,"based":1,"on":1,"requirements":1,"example":1,"where":1,"log":1,"into":1,"pass":1,"authentication":1,"gaining":1,"access":1,"security":1,"only":1,"allows":1,"specific":1,"authenticated":1,"together":1,"make":1,"up":1,"call":1,"suitable":1,"securing":1,"applications":1,"assets":1,"must":1,"exposed":1,"used":1,"business":1,"utilized":1,"agents":1,"agencies":1,"resellers":1,"etc":1,"examples":1,"mobile":1,"b2b":1,"like":1,"agency":1,"portals":1,"reseller":1,"require":1,"secure":1,"ensuring":1,"traffic":1,"ensures":1,"through":1,"no":1,"can":1,"actually":1,"establish":1,"their":1,"own":1,"connection":1,"original":1,"servers":1,"replacing":1,"current":1,"configuration":1,"itself":1,"contains":1,"privileges":1,"meaning":1,"even":1,"if":1,"breach":1,"occurs":1,"taken":1,"back":1,"established":1,"gateway":1,"takes":1,"place":1,"then":1,"formed":1,"section":1,"segmentation":1,"protection":1,"tools":1,"terms":1,"firewalls":1,"vpns":1,"comparison":1,"will":1,"made":1,"along":1,"showcasing":1,"advantages":1,"provided":1,"unlike":1,"apps":1,"do":1,"companys":1,"reduces":1,"risks":1,"related":1,"personal":1,"exploits":1,"malware":1,"devices":1,"networks":1,"managed":1,"whether":1,"user":1,"trojan":1,"horses":1,"vulnerable":1,"targeted":1,"hackers":1,"remain":1,"safe":1,"there":1,"direct":1,"tunnel":1,"between":1,"deploying":1,"model":1,"similar":1,"opening":1,"ports":1,"any":1,"remote":1,"would":1,"full":1,"blown":1,"audit":1,"hardening":1,"when":1,"considering":1,"includes":1,"dividing":1,"subnetworks":1,"reinforcing":1,"passwords":1,"closing":1,"unnecessary":1,"pertinent":1,"steps":1,"easy":1,"see":1,"preparations":1,"considerable":1,"project":1,"utilizing":1,"means":1,"these":1,"accessible":1,"web":1,"published":1,"requiring":1,"zero":1,"open":1,"changes":1,"fine":1,"grained":1,"role":1,"controls":1,"hr":1,"proxies":1,"everything":1,"available":1,"control":1,"you":1,"also":1,"think":1,"secured":1,"office":1,"building":1,"having":1,"front":1,"door":1,"whole":1,"nothing":1,"stopping":1,"people":1,"walking":1,"please":1,"once":1,"adding":1,"each":1,"floor":1,"floors":1,"representing":1,"individual":1,"system":1,"multi":1,"level":1,"systems":1,"so":1,"though":1,"one":1,"first":1,"entry":1,"cannot":1,"go":1,"doors":1,"multiple":1,"measures":1,"technology":1,"saves":1,"significant":1,"bandwidth":1,"support":1,"much":1,"more":1,"than":1,"laptop":1,"rest":1,"goes":1,"over":1,"regular":1,"furthermore":1,"critical":1,"difference":1,"architectures":1,"summarized":1,"figure":1,"hacker":1,"bypassed":1,"real":1,"mirrors":1,"themselves":1,"gains":1,"strong":1,"layers":1,"we":1,"discuss":1,"ignoring":1,"aspect":1,"shortly":1,"however":1,"important":1,"here":1,"step":1,"somehow":1,"breached":1,"form":1,"including":1,"segregation":1,"desktop":1,"allocated":1,"its":1,"distinct":1,"port":1,"said":1,"closed":1,"subsequently":1,"opened":1,"who":1,"authorization":1,"those":1,"an":1,"engineer":1,"b":1,"authenticates":1,"correctly":1,"engineers":1,"removing":1,"ability":1,"attempt":1,"lateral":1,"movement":1,"blocking":1,"preemptively":1,"bans":1,"attacks":1,"ips":1,"largest":1,"database":1,"db":1,"curated":1,"blacklists":1,"integration":1,"nist":1,"nvd":1,"us":1,"government":1,"national":1,"vulnerability":1,"exploit":1,"anti":1,"spam":1,"virus":1,"app":1,"detection":1,"google":1,"store":1,"dbs":1,"url":1,"script":1,"blocks":1,"prevent":1,"external":1,"hosted":1,"eg":1,"xss":1,"vulnerabilities":1,"preventing":1,"various":1,"injection":1,"query":1,"parameter":1,"parsing":1,"at":1,"layer":1,"sql":1,"xml":1,"injections":1,"convert":1,"mfa":1,"compliant":1,"heuristic":1,"rules":1,"outbound":1,"against":1,"leaks":1,"deep":1,"logging":1,"audits":1,"soc":1,"module":1,"logs":1,"admin":1,"comes":1,"process":1,"differ":1,"depending":1,"granular":1,"choices":1,"location":1,"prem":1,"cloud":1,"outside":1,"dmz":1,"installed":1,"scenario":1,"under":1,"assumption":1,"deployed":1,"virtual":1,"machine":1,"hardware":1,"within":1,"clients":1,"choose":1,"method":1,"installer":1,"executable":1,"file":1,"need":1,"run":1,"desktops":1,"wish":1,"connect":1,"securely":1,"below":1,"simple":1,"diagram":1,"instance":1,"both":1,"pcs":1,"install":1,"connects":1,"individually":1,"number":1,"accessing":1,"remotely":1,"running":1,"mapped":1,"certain":1,"after":1,"installation":1,"been":1,"successfully":1,"set":1,"formulate":1,"dhcp":1,"some":1,"changing":1,"wireless":1,"ethernet":1,"ensure":1,"stability":1,"thats":1,"restart":1,"service":1,"refreshed":1,"again":1,"most":1,"importantly":1,"previous":1,"connected":1,"originally":1,"remains":1,"same":1,"local":1,"loopback":1,"address":1,"generate":1,"rdp":1,"changed":1,"does":1,"matter":1,"forwarded":1,"during":1,"time":1,"popup":1,"appears":1,"create":1,"account":1,"login":1,"credentials":1,"chooses":1,"creating":1,"phase":1,"given":1,"turn":1,"unique":1,"id":1,"add":1,"currently":1,"existing":1,"instead":1,"successful":1,"maps":1,"machines":1,"created":1,"them":1,"connections":1,"per":1,"approach":1,"deploys":1,"containing":1,"reflectors":1,"perimeter":1,"desired":1,"services":1,"accessed":1,"large":1,"scale":1,"responsible":1,"forwarding":1,"still":1,"computers":1,"above":1,"note":1,"windows":1,"covers":1,"variety":1,"nav":1,"legacy":1,"short":1,"anything":1,"send":1,"gained":1,"why":1,"needs":1,"segment":1,"list":1,"provide":1,"addresses":1,"stored":1,"reference":1,"updated":1,"setting":1,"follows":1,"receive":1,"files":1,"manually":1,"join":1,"representative":1,"get":1,"walked":1,"notify":1,"completed":1,"configurations":1,"installing":1,"ova":1,"hyper":1,"v":1,"dev":1,"computer":1,"appliance":1,"virtualization":1,"vmware":1,"workstation":1,"oracle":1,"virtualbox":1,"package":1,"describe":1,"ovf":1,"descriptor":1,"optional":1,"manifest":1,"mf":1,"certificate":1,"additionally":1,"supports":1,"plug":1,"play":1,"sent":1,"physical":1,"box":1,"already":1,"confirmation":1,"power":1,"plugged":1,"administers":1,"skipping":1,"result":1,"depicted":1,"now":1,"differences":1,"discussed":1,"highlighted":1,"stated":1,"earlier":1,"choice":1,"instances":1,"requested":1,"program":1,"instructs":1,"particular":1,"static":1,"supported":1,"clipboard":1,"transfer":1,"restrictions":1,"just":1,"requires":1,"sending":1,"wake":1,"lan":1,"message":1,"assigned":1,"disclose":1,"name":1,"due":1,"nda":1,"refer":1,"adoption":1,"year":1,"duration":1,"years":1,"challenge":1,"had":1,"functions":1,"associated":1,"daily":1,"tasks":1,"private":1,"connectivity":1,"communications":1,"were":1,"threats":1,"upon":1,"resources":1,"explicit":1,"custom":1,"solutions":1,"lacking":1,"particularly":1,"as400":1,"solution":1,"terminated":1,"implemented":1,"built":1,"extra":1,"emphasis":1,"block":1,"incoming":1,"makes":1,"completely":1,"while":1,"mirrored":1,"hence":1,"registered":1,"allowed":1,"view":1,"asking":1,"consent":1,"our":1,"teleworking":1,"increasingly":1,"popular":1,"reasons":1,"work":1,"life":1,"balance":1,"widespread":1,"availability":1,"computing":1,"viable":1,"types":1,"organizations":1,"hit":1,"issue":1,"everyone":1,"facing":1,"globally":1,"covid":1,"pandemic":1,"causing":1,"great":1,"individuals":1,"struggling":1,"find":1,"way":1,"allow":1,"reliable":1,"keeping":1,"employees":1,"safety":1,"mind":1,"effectively":1,"efficiently":1,"expressed":1,"throughout":1,"document":1,"course":1,"mentioned":1,"applies":1,"relation":1,"adapting":1,"change":1,"extremely":1,"fast":1,"procedure":1,"limitations":1,"macos":1,"tablet":1,"smartphone":1,"cap":1,"amount":1,"different":1,"share":1,"among":1,"products":1,"market":1,"buy":1,"licenses":1,"bulk":1,"license":1,"creation":1,"very":1,"nature":1,"cyberattack":1,"immeasurable":1,"benefit":1,"corporation":1,"primary":1,"estimated":1,"information":1,"estimations":1,"known":1,"facts":1,"generic":1,"overview":1,"corporations":1,"calculate":1,"risk":1,"anyone":1,"rough":1,"estimation":1,"before":1,"approached":1,"least":1,"month":1,"impactful":1,"hacking":1,"statistics":1,"average":1,"cost":1,"usd":1,"excluding":1,"breaches":1,"small":1,"ones":1,"skew":1,"numerical":1,"value":1,"deduced":1,"stages":1,"response":1,"attack":1,"heavy":1,"costs":1,"incurred":1,"pour":1,"processes":1,"investigation":1,"assessment":1,"general":1,"crisis":1,"management":1,"notifying":1,"key":1,"third":1,"parties":1,"stakeholders":1,"emails":1,"letters":1,"notice":1,"engagement":1,"experts":1,"attempting":1,"minimize":1,"loss":1,"activities":1,"side":1,"effect":1,"disruption":1,"down":1,"losing":1,"regain":1,"new":1,"avoiding":1,"reputation":1,"bad":1,"faith":1,"post":1,"spend":1,"fees":1,"legalities":1,"recuperating":1,"losses":1,"patches":1,"training":1,"help":1,"desk":1,"staff":1,"outlook":1,"five":1,"never":1,"subjected":1,"previously":1,"months":1,"prior":1,"contacting":1,"ibm":1,"adopting":1,"underestimate":1,"damages":1,"joining":1,"basis":1,"seeing":1,"grand":1,"total":1,"million":1,"potential":1,"caused":1,"cyberattacks":1,"reduced":1,"implementing":1,"going":1,"fit":1,"every":1,"single":1,"hacked":1,"depends":1,"factors":1,"size":1,"severity":1,"hundreds":1,"millions":1,"dollars":1,"less":1,"lot":1,"spent":1,"decide":1,"hire":1,"pay":1,"legal":1,"lead":1,"dependent":1,"resolution":1,"path":1,"take":1,"brings":1,"nonspecific":1,"amp":1,"cdn":1,"waf":1,"ddos":1,"mitigation":1,"save":1,"money":1,"software":1,"hasily":1,"meet":1,"pci":1,"compliance":1,"fully":1,"isolated":1,"goals":1,"confidential":1,"communication":1,"aes":1,"encrypted":1,"military":1,"grade":1,"encryption":1,"gdpr":1,"foreign":1,"country":1,"yet":1,"able":1,"act":1,"improved":1,"performance":1,"crucial":1,"serve":1,"volume":1,"perform":1,"faster":1,"speed":1,"delay":1,"overall":1,"improvement":1,"job":1,"peace":1,"your":1,"provides":1,"well":1,"stress":1,"increasing":1,"productivity":1,"allocate":1,"funding":1,"goal":1,"streamlined":1,"organizational":1,"reduce":1,"inspire":1,"achieve":1,"remaining":1,"intensely":1,"focused":1,"satisfaction":1,"without":1,"distractions":1,"look":1,"forward":1,"future":1,"let":1,"know":1,"questions":1,"concerns":1}